#include <iostream>
#include <string>
#include "arr_org.h"

using namespace std;

void cinCheck()
{
 if (cin.fail())
    {
        cout << "Некорректный ввод!" << endl;
        cin.clear();
        cin.ignore(32767, '\n');
    }
}

//=============================================================================================
//Задание 2. Проверка числа через макрокоманду
//=============================================================================================

#define CHECK(a, b) \
if (a >=0 && a < b) \ 
return true \
else if(a > b && a <= 0) \
return true \
else return false;

//=============================================================================================
//Задание 3. Сортировка массива
//=============================================================================================
#define SIZE_ARR 7
#define SwapINT(a, b)\


int main()
{
    setlocale(LC_ALL, "Russian");
    //=============================================================================================
    //Задание 1 и 5. 
    //=============================================================================================


    //=============================================================================================
    //Задание 2. Проверка числа через макрокоманду
    //=============================================================================================
int a, b;
std::cout << "Введите число 1: ";
std::cin >> a;
cinCheck();
std::cout << endl;
std::cout << "Введите число 2: ";
std::cin >> b;
cinCheck();
std::cout << endl;    
std::cout << alphabool << CHECK(a, b) << std::endl;
#undef CHECK  //Не нужны нам запутывающие макросы в коде :)
    //=============================================================================================
    //Задание 3. Сортировка массива
    //=============================================================================================
int = arr1[SIZE_ARR];
std::cout << "Введите " << SIZE_ARR << " чисел: ";
for (int i = 0; i < SIZE_ARR; i++)
{
std::cin >> arr1[i];
cinCheck();
std::cout << " ";
}

    
    //=============================================================================================
    //Задание 4. 
    //=============================================================================================
 
    return 0;
}
